In [1]:
import pandas as pd
import numpy as np

In [ ]:
cust = pd.read_csv('customers.csv')
pro = pd.read_csv('products.csv')
tra = pd.read_csv('transactions.csv')

In [4]:
cust.shape

(2000, 6)

In [5]:
pro.shape

(150, 5)

In [6]:
tra.shape

(10015, 7)

In [7]:
cust.dtypes

customer_id        int64
customer_name     object
email             object
signup_date       object
country           object
age              float64
dtype: object

In [8]:
pro.dtypes

product_id        int64
product_name     object
category         object
supplier_id       int64
cost_price      float64
dtype: object

In [9]:
tra.dtypes

transaction_id      int64
customer_id         int64
product_id          int64
quantity          float64
price             float64
timestamp          object
payment_method     object
dtype: object

In [10]:
cust.head(3)

,customer_id,customer_name,email,signup_date,country,age
0,1,Customer41,customer410@yahoo.com,2022-01-28,UK,30.0
1,2,Custome41,custome411@email.com,2023-10-28,Mexico,29.0
2,3,customer41,customer412@email.com,2023-04-05,Australia,69.0

In [11]:
pro.head(3)

   product_id   product_name category  supplier_id  cost_price
0           1  Product_OFF_0     Toys           28      113.16
1           2  Product_SPO_1    Books           43      166.06
2           3  Product_SPO_2    Books           47      128.13

In [12]:
tra.head(3)

,transaction_id,customer_id,product_id,quantity,price,timestamp,payment_method
0,4292,130,89,1.0,112.87,2024-08-17 09:13:00,Credit Card
1,9107,271,98,1.0,211.90,2023-11-17 20:50:00,PayPal
2,7842,66,33,1.0,225.04,2023-03-21 23:23:00,Bank Transfer

In [13]:
miss = cust.isnull().sum()
print(miss)
miss1 = pro.isnull().sum()
print(miss1)
miss2 = tra.isnull().sum()
print(miss2)

customer_id        0
customer_name      0
email             53
signup_date        0
country            0
age              100
dtype: int64
product_id      0
product_name    0
category        3
supplier_id     0
cost_price      0
dtype: int64
transaction_id      0
customer_id         0
product_id          0
quantity           97
price             102
timestamp           0
payment_method    101
dtype: int64

In [16]:
tra['transaction_id'].duplicated().sum()

np.int64(15)

In [22]:
for i in tra.columns:
    if(tra[i].dtypes == 'int64'):
        tra.fillna(tra[i].mean(), inplace=True)

for i in cust.columns:
    if(cust[i].dtypes == 'int64'):
        cust.fillna(cust[i].mean(), inplace=True)

for i in pro.columns:
    if(pro[i].dtypes == 'int64'):
        pro.fillna(pro[i].mean(), inplace=True)

In [23]:
miss = cust.isnull().sum()
print(miss)
miss1 = pro.isnull().sum()
print(miss1)
miss2 = tra.isnull().sum()
print(miss2)

customer_id      0
customer_name    0
email            0
signup_date      0
country          0
age              0
dtype: int64
product_id      0
product_name    0
category        0
supplier_id     0
cost_price      0
dtype: int64
transaction_id    0
customer_id       0
product_id        0
quantity          0
price             0
timestamp         0
payment_method    0
dtype: int64

In [24]:
full_data = (
    tra
    .merge(cust, on='customer_id', how='left')
    .merge(pro,  on='product_id',  how='left')
)